(chapter "Епiграф")

(say "І лиш у снах я бачу правду,"
     "Брехню я бачу наяву."
     "Немов зрадливий блиск смарагда-"
     "Не мертву й не живу.")
(read)

; Початок
(chapter "У печерi")
(title "Ви прокинулись.")
(map "########################################"
     "~                                      #"
     "~    @                                 #"
     "~                                      #"
     "#                                      #"
     "#                                      #"
     "#                                      #"
     "#                                      #"
     "#                                      #"
     "#                                      #"
     "#                                      #"
     "#                                      #"
     "#                                      #"
     "#                                      #"
     "#                                      #"
     "#                                      #"
     "#                                      #"
     "#                                      #"
     "#                                      #"
     "########################################")
; кiлька слiв про мапу:
; свiтла нема, ГГ бачить тiльки те, до чого торкаэться
; щоби додати свiтло, треба його заспавнити

(setq meala (spawn #\@ 'me))
(spawn #\# 'wall)
(spawn #\~ 'water)

; после спавна 

;    |         1         2         3         4         5         6         7        |
(say "Так тихо. Не чути нічого."
     "Я не чую навіть свого дихання, і це так дивно. А ще тут темно. Тихо і темно."
     "Темрява плавно огортає мене з усіх сторін, перебирає тонкими пальцями моє"
     " волосся, заплітаючи дивні зачіски, закриває холодною долонею очі."
     "Я плаваю у ній, неначе у воді.")
(read)

(say "Так спокійно… Я відчуваю своє серцебиття. Тук — тук, тук — тук.")
(read)

(say "Скільки часу я тут пливу? Не знаю. Можливо, навіть сотню років. Можливо,"
     " п’ять хвилин. Я давно втратила лік часу. Я втратила спогади. Не пам’ятаю"
     " нічого. Це було давно.")
(read)

(say "Так темно… Наче у склепі. Неначе далеко- далеко у космосі. Ні. У космосі зорі,"
     " планети і галактики, а тут непроглядна темрява і пустота."
     "Може, я і справді померла, і мене похоронили, а це й справді склеп?")
(read)

(say "Раптом хтось починає шепотіти. Єдиний звук за багато часу. Такий жаданий"
     " звук..."
     "Але чому він мене так лякає?"
     "Шепіт розганяє тишу, холодною змією заповзає у розум, заповнює всю свідомість,"
     " витісняючи усе, крім страху і холоду.")
(read)

(say "Так страшно… Врятуйте мене! Хто - небудь! Ні... Тут нікого нема. Мене не"
     " врятує ніхто."
     "Навіть я сама не зможу порятувати себе. Шепіт струїться далі. Це холодний"
     " жіночий голос.")
(read)

(setq voice (spawn #\~))

(say 'voice
     "-- Слухай мене. Слухай уважно, - розбивається він ехом, - Ти - Меала."
     " Запам'ятай, і ніколи не забувай, твоє ім'я - Меала. Повтори!")
(let loop ()
   (if (not (eq? (read) 'Меала))
      (begin
         (say "-- Повтори!")
         (loop))))

(say 'meala
     "-- Так, я Меала. – якась тиха струна у душі здригнулась і затремтіла,"
     " щойно я почула свій голос."
     "Він відбивається об почуття і вертається назад.")
(read)

(say 'voice
     "-- Чудово… молодець... - шепіт радісний і задоволений, проте незважаюче на"
     " це, нескінченно холодний і жорстокий,- Прокидайся! Ти маєш...")

(spawn #\! 'light)
(say "Він затихає, лишаючи мене одну. Я бачу світло! Я не одна! Не одна!..")

(read)
(say "bye.")
